[Killed] ArrowFunction
src/app/app-routing.module.ts:9:9
     path: 'home',
     loadChildren: () =>
       import('./modules/home/home.module').then(
-        (m) => m.HomeModule
+        () => undefined
       ),
   },
killedBy: AppRoutingModule should navigate to a non-existing route and redirect to "home"
statusReason: TypeError: Cannot read properties of undefined (reading 'hasOwnProperty')
