[Killed] BlockStatement
core/services/pokemon-service/pokemon.service.ts:13:45
 
   constructor(private http: HttpClient) { }
 
-  getPokemon(name: string): Observable<any> {
-    return this.http.get(`${this.baseUrl}/pokemon/${name}`);
-  }
+  getPokemon(name: string): Observable<any> {}
 }
 
killedBy: PokemonService should return a Pokemon data
statusReason: TypeError: Cannot read properties of undefined (reading 'subscribe')
