[Killed] BlockStatement
core/services/sample-service/sample.service.ts:7:20
  providedIn: 'root'
 })
 export class SampleService {
- getData(): string {
-   return "Datos del servicio";
- }
+ getData(): string {}
 }
 
killedBy: HomeComponent should call getData() method from SampleService on component init
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Datos del servicio"
Received: undefined

[Killed] StringLiteral
core/services/sample-service/sample.service.ts:8:11
 })
 export class SampleService {
  getData(): string {
-   return "Datos del servicio";
+   return "";
  }
 }
killedBy: HomeComponent should call getData() method from SampleService on component init
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Datos del servicio"
Received: ""
