[Killed] BooleanLiteral
modules/home/components/home.component.ts:25:15
 export class HomeComponent implements OnInit {
   title = 'Home component';
   count = 0;
-  isVisible = false;
+  isVisible = true;
   data!: string;
 
killedBy: HomeComponent should toggle the boolean property when toggle visibility button is clicked
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
modules/home/components/home.component.ts:30:20
 
   constructor(private sampleService: SampleService) {}
 
-  ngOnInit(): void {
-    this.data = this.sampleService.getData();
-  }
+  ngOnInit(): void {}
 
   increment(): void {
killedBy: HomeComponent should call getData() method from SampleService on component init
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
modules/home/components/home.component.ts:34:21
     this.data = this.sampleService.getData();
   }
 
-  increment(): void {
-    this.count++;
-  }
+  increment(): void {}
 
   toggleVisibility(): void {
killedBy: HomeComponent should update the count property when increment button is clicked
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] UpdateOperator
modules/home/components/home.component.ts:35:5
   }
 
   increment(): void {
-    this.count++;
+    this.count--;
   }
 
killedBy: HomeComponent should update the count property when increment button is clicked
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: -1

[Killed] BlockStatement
modules/home/components/home.component.ts:38:28
     this.count++;
   }
 
-  toggleVisibility(): void {
-    this.isVisible = !this.isVisible;
-  }
+  toggleVisibility(): void {}
 }
 
killedBy: HomeComponent should toggle the boolean property when toggle visibility button is clicked
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BooleanLiteral
modules/home/components/home.component.ts:39:22
   }
 
   toggleVisibility(): void {
-    this.isVisible = !this.isVisible;
+    this.isVisible = this.isVisible;
   }
 }
killedBy: HomeComponent should toggle the boolean property when toggle visibility button is clicked
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false
