[Survived] BlockStatement
mutation-testing/components/bad-tests/bad-tests.component.ts:9:37
   styleUrls: ['./bad-tests.component.css'],
 })
 export class BadTestsComponent {
-  add(a: number, b: number): number {
-    return a + b;
-  }
+  add(a: number, b: number): number {}
 
   increase(value: number): number {

[Survived] BlockStatement
mutation-testing/components/bad-tests/bad-tests.component.ts:13:35
     return a + b;
   }
 
-  increase(value: number): number {
-    return value + 1;
-  }
+  increase(value: number): number {}
 
   sendGreeting(name: string): string {

[Survived] ArithmeticOperator
mutation-testing/components/bad-tests/bad-tests.component.ts:14:12
   }
 
   increase(value: number): number {
-    return value + 1;
+    return value - 1;
   }
 

[Survived] BlockStatement
mutation-testing/components/bad-tests/bad-tests.component.ts:17:38
     return value + 1;
   }
 
-  sendGreeting(name: string): string {
-    return `Hello, ${name}!`;
-  }
+  sendGreeting(name: string): string {}
 
   isNegative(number: number): boolean {

[Survived] StringLiteral
mutation-testing/components/bad-tests/bad-tests.component.ts:18:12
   }
 
   sendGreeting(name: string): string {
-    return `Hello, ${name}!`;
+    return ``;
   }
 

[Survived] BlockStatement
mutation-testing/components/bad-tests/bad-tests.component.ts:21:39
     return `Hello, ${name}!`;
   }
 
-  isNegative(number: number): boolean {
-    return number < 0;
-  }
+  isNegative(number: number): boolean {}
 
   isValid(age: number, hasPermission: boolean): boolean {

[Survived] EqualityOperator
mutation-testing/components/bad-tests/bad-tests.component.ts:22:12
   }
 
   isNegative(number: number): boolean {
-    return number < 0;
+    return number <= 0;
   }
 

[Survived] ConditionalExpression
mutation-testing/components/bad-tests/bad-tests.component.ts:22:12
   }
 
   isNegative(number: number): boolean {
-    return number < 0;
+    return true;
   }
 

[Survived] BlockStatement
mutation-testing/components/bad-tests/bad-tests.component.ts:25:57
     return number < 0;
   }
 
-  isValid(age: number, hasPermission: boolean): boolean {
-    return age >= 18 && hasPermission;
-  }
+  isValid(age: number, hasPermission: boolean): boolean {}
 
   updateStock(currentStock: number, additionalUnits: number): number {

[Survived] EqualityOperator
mutation-testing/components/bad-tests/bad-tests.component.ts:26:12
   }
 
   isValid(age: number, hasPermission: boolean): boolean {
-    return age >= 18 && hasPermission;
+    return age < 18 && hasPermission;
   }
 

[Survived] ConditionalExpression
mutation-testing/components/bad-tests/bad-tests.component.ts:26:12
   }
 
   isValid(age: number, hasPermission: boolean): boolean {
-    return age >= 18 && hasPermission;
+    return false;
   }
 

[Survived] BlockStatement
mutation-testing/components/bad-tests/bad-tests.component.ts:29:70
     return age >= 18 && hasPermission;
   }
 
-  updateStock(currentStock: number, additionalUnits: number): number {
-    currentStock += additionalUnits;
-    return currentStock;
-  }
+  updateStock(currentStock: number, additionalUnits: number): number {}
 
   getGreeting(): string {

[Survived] AssignmentOperator
mutation-testing/components/bad-tests/bad-tests.component.ts:30:5
   }
 
   updateStock(currentStock: number, additionalUnits: number): number {
-    currentStock += additionalUnits;
+    currentStock -= additionalUnits;
     return currentStock;
   }

[Survived] BlockStatement
mutation-testing/components/bad-tests/bad-tests.component.ts:34:25
     return currentStock;
   }
 
-  getGreeting(): string {
-    return 'Hello, world!';
-  }
+  getGreeting(): string {}
 
   getData(callback: () => void): void {

[Survived] StringLiteral
mutation-testing/components/bad-tests/bad-tests.component.ts:35:12
   }
 
   getGreeting(): string {
-    return 'Hello, world!';
+    return "";
   }
 

[Survived] BlockStatement
mutation-testing/components/bad-tests/bad-tests.component.ts:38:39
     return 'Hello, world!';
   }
 
-  getData(callback: () => void): void {
-    callback();
-  }
+  getData(callback: () => void): void {}
 }
 
