[Killed] BlockStatement
mutation-testing/components/good-tests/good-tests.component.ts:9:37
   styleUrls: ['./good-tests.component.css']
 })
 export class GoodTestsComponent {
-  add(a: number, b: number): number {
-    return a + b;
-  }
+  add(a: number, b: number): number {}
 
   increase(value: number): number {
killedBy: GoodTestsComponent should add two numbers
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 9
Received: undefined

[Killed] ConditionalExpression
mutation-testing/components/good-tests/good-tests.component.ts:22:12
   }
 
   isNegative(number: number): boolean {
-    return number < 0;
+    return false;
   }
 
killedBy: GoodTestsComponent should return true for negative numbers
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] ConditionalExpression
mutation-testing/components/good-tests/good-tests.component.ts:26:12
   }
 
   isValid(age: number, hasPermission: boolean): boolean {
-    return age >= 18 && hasPermission;
+    return true;
   }
 
killedBy: GoodTestsComponent should check valid
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
mutation-testing/components/good-tests/good-tests.component.ts:26:12
   }
 
   isValid(age: number, hasPermission: boolean): boolean {
-    return age >= 18 && hasPermission;
+    return true && hasPermission;
   }
 
killedBy: GoodTestsComponent should check valid
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true
